*** Navigation
:PROPERTIES:
:ID:       8734C1A6-C55D-4792-BF87-1B99D3BF229D
:END:

The navigation bar that is shared by all pages is in the =:html-home/up-format=
property. This is a format string with two arguments: the root directory and the
directory above the current directory.

#+begin_src emacs-lisp +n
(setq blog-html-up
      "<h1 class=\"my-3 mt-sm-5 h3 text-center\">Antoine Kalmbach</h1>
       <ul class=\"nav justify-content-center mb-5\">
         <li class=\"nav-item\">
          <a class=\"nav-link\" href=\"%s\">Index</a>
         </li>
         <li class=\"nav-item\">
          <a class=\"nav-link\" href=\"/about.html\">About</a>
         </li>
         <li class=\"nav-item\">
          <a class=\"nav-link\" href=\"/archive.html\">Archive</a>
         </li>
         <li class=\"nav-item\">
          <a class=\"nav-link\" href=\"/feed.xml\">RSS</a>
         </li>
       </ul>")
#+end_src

#+RESULTS:
#+begin_example
<h1 class="my-3 mt-sm-5 h3 text-center">Antoine Kalmbach</h1>
       <ul class="nav justify-content-center mb-5">
         <li class="nav-item">
          <a class="nav-link" href="%s">Index</a>
         </li>
         <li class="nav-item">
          <a class="nav-link" href="/about.html">About</a>
         </li>
         <li class="nav-item">
          <a class="nav-link" href="/archive.html">Archive</a>
         </li>
         <li class="nav-item">
          <a class="nav-link" href="/feed.xml">RSS</a>
         </li>
       </ul>
#+end_example

*** Footer
:PROPERTIES:
:ID:       30323E30-3135-43FD-8B12-ECAB417B7D35
:END:

The footer renders using the /postamble/ defined in =:html-postamble=. I include
the [[https://creativecommons.org/licenses/by-sa/4.0/][CC BY-SA]] license notice, since a copyright notice is unnecessary these
days. I relaxed the license from [[https://creativecommons.org/licenses/by-nc-sa/2.0/][CC BY-NC-SA]] since I don't really care whether
any of my drivel is used for commercial purposes or not, especially the code examples.

#+begin_src emacs-lisp +n
(setq blog-html-down
      "<hr><address>Content licensed under <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\">CC BY-SA 4.0</a>. Last modified on %T.")
#+end_src

#+RESULTS:
: <hr><address>Content licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC BY-SA 4.0</a>. Last modified on %T.

** The configuration
:PROPERTIES:
:ID:       940FF517-F228-4280-A3D4-DB29275CB521
:END:

Now we've defined all we need for the project configuration. Without further
ado:

#+begin_src emacs-lisp +n
  (setq org-publish-project-alist
        `(("posts"
           :base-directory ,(concat blog-root "src/")        ;; the sources of the posts
           :exclude ".*drafts/.*\\|feed.*"                   ;; don't publish draft posts
           :base-extension "org"                             ;; only org files

           :publishing-directory ,(concat blog-root "out/")  ;; results go here
           :publishing-function blog-publish-html            ;; the function we use to publish

           :recursive t                                      ;; publish all files recursively

           :html-link-home "/"                               ;; home points here
           :html-link-up "/"                                 ;; up as well
           :html-head-extra ,blog-html-head-extra            ;; <head> conents
           :html-head-include-scripts t                      ;; add org built-in js 
           :html-head-include-default-style nil              ;; no org default css
           :html-home/up-format ,blog-html-up                ;; the navigation menu
           :html-preamble blog-html-preamble-fmt             ;; title (preamble) formating
           :html-postamble ,blog-html-down                   ;; footer
           :html-metadata-timestamp-format "%B %e, %Y %R %Z" ;; timestamps in the footer

           :with-toc nil                                     ;; no toc by default
           :with-title nil                                   ;; no title either
           :with-date t                                      ;; has no effect either
           :section-numbers nil                              ;; no section numbers
           :html-doctype "html5"                             ;; fancy semantic html5 tags
           :html-html5-fancy t                               ;; fancy the max
           :htmlized-source t                                ;; use CSS for sources, instead of inline 

           :auto-sitemap t                                   ;; publish the index
           :sitemap-filename "posts.org"                     ;; to this file
           :sitemap-title "Index"                            ;; with this title
           :sitemap-style list                               ;; no effect

           ;; these functions determine the style of the index
           :sitemap-sort-files anti-chronologically
           :sitemap-format-entry blog-sitemap-format-entry
           :sitemap-function blog-sitemap-function
           ;; )))
           )
          ("assets"
           :base-directory ,(concat blog-root "src/assets/")
           :base-extension "png\\|css\\|svg\\|js\\|jpg\\|gif\\|html"
           :publishing-directory ,(concat blog-root "out/assets/")
           :publishing-function org-publish-attachment
           :recursive t)
          ("archive"
           :base-directory ,(concat blog-root "src/") ;; same files as in the previous project
           :base-extension "org"
           :recursive t

           :publishing-function ignore ;; don't publish the files a second time
           :publishing-directory ,(concat blog-root "out/") ;
           :auto-sitemap t
           :sitemap-filename "archive.org"
           :sitemap-title "Archive"
           :sitemap-style list
           :sitemap-function blog-year-archive-sitemap-function
           :sitemap-format-entry blog-year-archive-sitemap-entry
           :sitemap-sort-files anti-chronologically)
          ("rss"
           :base-directory ,(concat blog-root "src/")
           :base-extension "org"
           :exclude ,(regexp-opt '("archive.org" "posts.org" "index.org" "about.org"))
           :recursive t

           :description "The website of Antoine Kalmbach"
           :html-link-home "http://ane.github.io/"
           :html-link-use-abs-url t
           :html-link-org-files-as-html t
           :rss-extension "xml"
           :rss-feed-url "http://ane.github.io/feed.xml"
           :rss-image-url "http://ane.github.io/assets/images/me.png"

           :publishing-directory ,(concat blog-root "out/") ;
           :publishing-function blog-rss-publishing-function

           :auto-sitemap t
           :sitemap-filename "feed.org"
           :sitemap-title "Feed"
           :sitemap-style list
           :sitemap-function blog-rss-sitemap
           :sitemap-format-entry blog-rss-sitemap-entry
           :sitemap-sort-files anti-chronologically

           :with-toc nil
           :section-numbers nil)
          ("blog"
           :components ("assets" "archive" "rss" "posts"))))

#+end_src

#+RESULTS:
| posts | :base-directory | /Users/akalmbach/code/kakka/src/ | :exclude | .*drafts/.*\ | feed.* | :base-extension | org | :publishing-directory | /Users/akalmbach/code/kakka/out/ | :publishing-function | blog-publish-html | :recursive | t | :html-link-home | / | :html-link-up | / | :html-head-extra | <script src="/assets/hyphenator.js" type="text/javascript"></script> |

This creates three components for the =blog= project:

- **posts**, the blog posts used to generate the [[file:src/index.org][index]]
- **archive**, which is a secondary sitemap used to generate the [[file:src/archive.org][archive]]
- **assets**, a project that just copies the images and other static crap to the
  output directory
- **rss** that publishes RSS

So, now hitting either @@html:<kbd>F3</kbd>@@ will publish the =blog= project,
which publishes everything I need. Next, it's time for something completely different.
